
Процедура ккДобавитьМестоКомандировкиНаФорму(Форма) Экспорт
	
	СтруктураОформления = Новый Структура("Вид,ПутьКДанным,ПоложениеЗаголовка",ВидПоляФормы.ПолеВвода
								,"Объект.ккМестоКомандировки",ПоложениеЗаголовкаЭлементаФормы.Авто); 
								
	ккОбщегоНазначенияСервер.ДобавитьПолеНаФорму(Форма,"ккМестоКомандировки",СтруктураОформления, Форма.Элементы.ГруппаДанныеДляПечати);
	Форма.Элементы.ккМестоКомандировки.УстановитьДействие("ПриИзменении", "ккПодключаемый_МестоКомандировкиПриИзменении"); 
	
КонецПроцедуры


Процедура МестоКомандировкиПриИзмененииНаСервере(Форма) Экспорт
	Объект = Форма.Объект;
	СотрудникМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Сотрудник);
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(истина, СотрудникМассив,"Подразделение", Объект.ДатаНачала);
	Если ДанныеСотрудника.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	СтруктурнаяЕдиница = ДанныеСотрудника[0].Подразделение;
	
	Справочники.ПодразделенияОрганизаций.ПодчиненныеСтруктурныеЕдиницы(СтруктурнаяЕдиница);
	
	ТаблицаНастроек = РегистрыСведений.ТерриториальныеУсловияПФР.СрезПоследних(Объект.ДатаНачала, Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница));
	Если ТаблицаНастроек.Количество() > 0 Тогда
		ТерриториальныеУсловия = ТаблицаНастроек[0].ТерриториальныеУсловияПФР;
	Иначе
		ТерриториальныеУсловия = Неопределено;
	КонецЕсли;
	
	ТерриториальныеУсловияМестаКомандировки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ккМестоКомандировки, "ТерриториальныеУсловия");
 
	
	Если ТерриториальныеУсловия <> Неопределено 
		И ТерриториальныеУсловия <> ТерриториальныеУсловияМестаКомандировки тогда
		Объект.ТерриториальныеУсловияНаПериодКомандировки = ТерриториальныеУсловияМестаКомандировки;
		Объект.ИзменилисьТерриториальныеУсловия = истина;
	КонецЕсли;
КонецПроцедуры