
&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	НачатьТранзакцию();
	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ();
	РасчетыНалогоплательщиковСБюджетомПоНДФЛ();
	СведенияОДоходахНДФЛ();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура РасчетыНалоговыхАгентовСБюджетомПоНДФЛ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация КАК Организация,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОрганеНовая
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	               |		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо
	               |			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор
	               |			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.НомерСтроки = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НомерСтроки
	               |ГДЕ
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане <> РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение.РегистрацияВНалоговомОргане
	               |	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение В(&Подразделения)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") цикл
		НаборЗаписей = РегистрыНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		тз = НаборЗаписей.Выгрузить();
		Пока Выборка.Следующий() цикл
			СтруктураПоиска = Новый Структура("ФизическоеЛицо, Ставка, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане, ВключатьВДекларациюПоНалогуНаПрибыль, ИсчисленоПоДивидендам");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			ЗаписиДляИзменения = Тз.НайтиСтроки(СтруктураПоиска);
			Для каждого Запись из ЗаписиДляИзменения цикл
				Если ЗначениеЗаполнено(Выборка.РегистрацияВНалоговомОрганеНовая) тогда
					Запись.РегистрацияВНалоговомОргане = Выборка.РегистрацияВНалоговомОрганеНовая;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НаборЗаписей.Загрузить(тз);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчетыНалогоплательщиковСБюджетомПоНДФЛ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОрганеНовая,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода КАК КодДохода,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение КАК Подразделение,
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	               |ГДЕ
	               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение.РегистрацияВНалоговомОргане <> РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане
	               |	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение В(&Подразделения)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") цикл
		НаборЗаписей = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		тз = НаборЗаписей.Выгрузить();
		Пока Выборка.Следующий() цикл
			СтруктураПоиска = Новый Структура("Подразделение, ФизическоеЛицо, СтавкаНалогообложенияРезидента, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане, КодДохода");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			ЗаписиДляИзменения = Тз.НайтиСтроки(СтруктураПоиска);
			Для каждого Запись из ЗаписиДляИзменения цикл
				Если ЗначениеЗаполнено(Выборка.РегистрацияВНалоговомОрганеНовая) тогда
					Запись.РегистрацияВНалоговомОргане = Выборка.РегистрацияВНалоговомОрганеНовая;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НаборЗаписей.Загрузить(тз);
		НаборЗаписей.Записать();
	КонецЦикла;

	
КонецПроцедуры

Процедура СведенияОДоходахНДФЛ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	СведенияОДоходахНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	               |	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
	               |	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
	               |	СведенияОДоходахНДФЛ.СтавкаНалогообложения КАК СтавкаНалогообложения,
	               |	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	               |	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
	               |	СведенияОДоходахНДФЛ.Подразделение.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОрганеНовая,
	               |	СведенияОДоходахНДФЛ.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
	               |ГДЕ
	               |	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане <> СведенияОДоходахНДФЛ.Подразделение.РегистрацияВНалоговомОргане
	               |	И СведенияОДоходахНДФЛ.Подразделение В(&Подразделения)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") цикл
		НаборЗаписей = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		тз = НаборЗаписей.Выгрузить();
		Пока Выборка.Следующий() цикл
			СтруктураПоиска = Новый Структура("Подразделение, ФизическоеЛицо, СтавкаНалогообложения, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане, КодДохода, КодВычета, ИсточникДоходаЗаПределамиРФ");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			ЗаписиДляИзменения = Тз.НайтиСтроки(СтруктураПоиска);
			Для каждого Запись из ЗаписиДляИзменения цикл
				Если ЗначениеЗаполнено(Выборка.РегистрацияВНалоговомОрганеНовая) тогда
					Запись.РегистрацияВНалоговомОргане = Выборка.РегистрацияВНалоговомОрганеНовая;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НаборЗаписей.Загрузить(тз);
		НаборЗаписей.Записать();
	КонецЦикла;

	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

Процедура ЗаполнитьПодразделенияПоMU()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.ккCodeBlock.ManagementUnit = &ManagementUnit
	|	И ПодразделенияОрганизаций.Владелец = &Владелец";
	Запрос.УстановитьПараметр("ManagementUnit", ManagmentUnit);
	Запрос.УстановитьПараметр("Владелец", Оргаинзация);
	Запрос.Текст = ТекстЗапроса; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Подразделения.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ManagmentUnitПриИзмененииНаСервере()
	ЗаполнитьПодразделенияПоMU();
КонецПроцедуры

&НаКлиенте
Процедура ManagmentUnitПриИзменении(Элемент)
	ManagmentUnitПриИзмененииНаСервере();
КонецПроцедуры
