
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
    МассивНазначений = Новый Массив;
    МассивНазначений.Добавить("Документ.Увольнение");
	МассивНазначений.Добавить("Документ.Отпуск");
	МассивНазначений.Добавить("Документ.Командировка");
	МассивНазначений.Добавить("Документ.БольничныйЛист");

    ПараметрыРегистрации.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
    ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
    ПараметрыРегистрации.Вставить("Наименование", "РассчитатьДокументы");
    ПараметрыРегистрации.Вставить("Версия", "1.0");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    ПараметрыРегистрации.Вставить("Информация", "Рассчитать документы увольнения отпуска или командировки за период");

	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();

    ДобавитьКоманду(ТаблицаКоманд,
    "Рассчитать увольнения",
    "РассчитатьУвольнение",
    "ОткрытиеФормы",
    Истина);
	
	 ДобавитьКоманду(ТаблицаКоманд,
    "Рассчитать отпуска",
    "РассчитатьОтпуск",
    "ОткрытиеФормы",
    Истина);

	 ДобавитьКоманду(ТаблицаКоманд,
    "Рассчитать командировки",
    "РассчитатьКомандировка",
    "ОткрытиеФормы",
    Истина);

	 ДобавитьКоманду(ТаблицаКоманд,
    "Рассчитать больничные листы",
    "РассчитатьБольничныйЛист",
    "ОткрытиеФормы",
    Истина);


    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

    Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
  Команды = Новый ТаблицаЗначений;
  Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
  Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
  Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
  НоваяКоманда = ТаблицаКоманд.Добавить();
  НоваяКоманда.Представление = Представление;
  НоваяКоманда.Идентификатор = Идентификатор;
  НоваяКоманда.Использование = Использование;
  НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
  НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры